Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.ThermalResistance
The thermal resistance (R-value) of the material.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.SpecificHeatCapacity
The specific heat capacity of the material.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.Density
The density of the material.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.ThermalConductivity
The thermal conductivity of the material.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.Thickness
The thickness of the material.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.Description
The description of the material.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.MaterialName
The name of the material.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial
A description of a material with thermal properties in a composite construction.
Since:
2024